app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("text", "user_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "asd"], ["user_name", "asdfg"], ["created_at", "2016-11-08 17:42:50.179916"], ["updated_at", "2016-11-08 17:42:50.179916"]]